# 판다스

In [1]:
import pandas as pd

# 시리즈  클래스

In [3]:
s = pd.Series([9904312, 3448737, 2890451, 2466052], 
              index=["서울", "부산","인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [5]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [6]:
s.values

array([9904312, 3448737, 2890451, 2466052])

In [7]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

# 시리즈 인덱싱

In [8]:
s[1], s["부산"]

(3448737, 3448737)

In [9]:
s[3], s["대구"]

(2466052, 2466052)

In [10]:
s[[0,3,1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [11]:
s[["서울", "대구", "부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [12]:
s[(250e4 < s) & (s < 500e4)] # 인구가 250만 초과, 500만 미만

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [14]:
s[1:3] #두번째(1)부터 세번째(2)까지 (3포함하지않음)

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [15]:
s["부산":"대구"] #부산에서 대구까지(대구포함)

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [16]:
s0 = pd.Series(range(3), index=["a","b","c"])
s0

a    0
b    1
c    2
dtype: int64

In [18]:
print(s0.a)
print(s0.b)

0
1

In [19]:
"서울" in s # 인덱스 라벨 중 서울이 있는지?

True

In [21]:
"대전" in s # 인덱스 라벨 중 대전이 있는지?

False

In [22]:
for k,v in s.items():
    print("%s = %d" % (k,v))

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

In [31]:
s2 = pd.Series({"서울" : 9631482, "부산" : 3393191, "인천" : 2632035, "대전": 1490158})

In [33]:
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [38]:
s2 = pd.Series({"서울" : 9631482, "부산" : 3393191, "인천" : 2632035, 
                "대전" : 1490158}, index=["부산", "서울", "인천", "대전"])
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

# 인덱스 기반 연산

- 두 개의 시리즈 차이를 구하기 (인덱스가 같은 데이터에 대해서만 차이를 구함)

In [39]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [40]:
s.values - s2.values

array([ 6511121, -6182745,   258416,   975894])

In [41]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [42]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [43]:
# 인구 증가율
rs = (s - s2) / s2 *100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

# 데이터의 갱신, 추가, 삭제

In [44]:
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [45]:
rs["대구"] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [46]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

- 연습문제 4.1.1 
 1. 임의로 두 개의 시리즈 객체를 만듦. 모두 문자열 인덱스를 가져야 하며, 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야함
 2. 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 함

In [49]:
s_1 = pd.Series({"키" : 179, "몸무게" : 75, "나이" : 27, "왕만두생일" : 950115})
s_2 = pd.Series({"키" : 164, "몸무게" : 50, "나이" : 30, "공주생일" : 920630})

In [50]:
s_1 + s_2

공주생일       NaN
나이        57.0
몸무게      125.0
왕만두생일      NaN
키        343.0
dtype: float64

# 데이터프레임 클래스

In [52]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" : [0.0283, 0.0163, 0.0982, 0.0141] 
}

columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [53]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [54]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [55]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [56]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

- 연습문제 4.1.2 데이터 프레임 만들기
 1. 열의 갯수와 행의 갯수가 각각 5개 이상이어야 함
 2. 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있음

In [63]:
data = { 
    "키" : [179,164,167,185,160],
    "몸무게" : [75.0, 50.0, 53.2, 80.2, 57.6],
    "나이" : [27,30,27,30,30],
    "이름" : ["정민석", "김건희", "김신지", "가상1", "가상2"],
    "키-몸무게" : [104,114,113.8,104.8,102.4]
}

columns = ["이름", "나이", "키", "몸무게", "키-몸무게"]
index = ["남자", "여자", "여자", "남자", "여자"]

ex_df = pd.DataFrame(data, index=index, columns=columns)
ex_df

     이름  나이    키   몸무게  키-몸무게
남자  정민석  27  179  75.0  104.0
여자  김건희  30  164  50.0  114.0
여자  김신지  27  167  53.2  113.8
남자  가상1  30  185  80.2  104.8
여자  가상2  30  160  57.6  102.4

In [65]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

# 열 데이터의 갱신,추가,삭제

In [66]:
# "2010-2015 증가율" 이라는 이름의 열 추가
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [67]:
# 2005-2010 증가율" 이라는 이름의 열 추가
df["2005-2010 증가율"] = ((df["2010"]-df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [68]:
# "2010-2015 증가율" 이라는 이름의 열 삭제
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

# 열 인덱싱

In [69]:
# 하나의 열만 인덱싱하면 시리즈 반환
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [70]:
# 여러 개의 열을 인덱싱하면 부분적인 데이터프레임 반환
df[["2010", "2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [71]:
# 하나의 열만 빼내면서 데이터프레임 자료형을 유지하고 싶다면, 원소가 하나인 리스트를 써서 인덱싱
df[["2010"]]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [72]:
type(df[["2010"]])

pandas.core.frame.DataFrame

- 데이터프레임의 열 인덱스가 문자열 라벨을 가지고 있는 경우 : 정수 인덱스를 열 인덱싱에 사용 불가
- 문자열이 아닌 정수형 열 인덱스를 가지는 경우에는 인덱스 값으로 정수 사용 가능

In [75]:
import numpy as np

In [79]:
df2= pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [80]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int64

In [81]:
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

# 행 인덱싱

- 데이터프레임에서 행 단위로 인덱싱을 하고자 하면 항상 슬라이싱을 해야 함
- 인덱스의 값이 문자 라벨이면 라벨 슬라이싱 가능

In [82]:
df[:1]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [83]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [85]:
df[1:3]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54

In [86]:
df["서울":"부산"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40

# 개별 데이터 인덱싱

In [87]:
df["2015"]["서울"]

9904312

- 연습 문제 4.1.3 : 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리

1. 모든 학생의 수학 점수를 시리즈로 나타내기
2. 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타내기
3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가
4. 방자의 영어 점수를 80점으로 수정, 평균 점수 다시 계산
5. 춘향의 점수를 데이터 프레임으로 나타내기
6. 향단의 점수를 시리즈로 나타내기

In [90]:
data = {
    "국어" : [80, 90, 70, 30],
    "영어" : [90, 70, 60, 40],
    "수학" : [90, 60, 80, 70],
}

columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]

df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [94]:
# 모든 학생의 수학 점수를 시리즈로

df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [99]:
# 모든 학생의 국어와 영어 점수를 데이터프레임으로
df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [102]:
# 모든 학생의 각 과목 평균 점수를 새로운 열로 추가
df["평균 점수"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round(1)
df

    국어  영어  수학  평균 점수
춘향  80  90  90   86.7
몽룡  90  70  60   73.3
향단  70  60  80   70.0
방자  30  40  70   46.7

In [108]:
# 방자의 영어 점수를 80 점으로 수정하고 평균 점수 다시 계산

df.loc["방자","영어"] = 80
df

df["평균 점수"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round(1)
df

    국어  영어  수학  평균 점수
춘향  80  90  90   86.7
몽룡  90  70  60   73.3
향단  70  60  80   70.0
방자  30  80  70   60.0

In [116]:
# 춘향의 점수를 데이터 프레임으로 나타내기

df[0:1]

    국어  영어  수학  평균 점수
춘향  80  90  90   86.7

In [117]:
# 향단의 점수를 시리즈로 나타냄

df.loc["향단",:]

국어       70.0
영어       60.0
수학       80.0
평균 점수    70.0
Name: 향단, dtype: float64

# 데이터 입출력

- %%writefile 명령 : 샘플 데이터로 사용할 csv 파일을 writefile 매직(magic) 명령으로 만듦
- 텍스트 파일을 만드는 명령

In [118]:
%%writefile sample1.csv

c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

#  csv 파일 입력

- csv 파일로부터 데이터를 읽어 데이터프레임 만들때 pandas.read_csv 함수 사용
- 함수의 입력값으로 파일 이름을 넣음

In [119]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [122]:
%%writefile sample2.csv

1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample2.csv

In [123]:
pd.read_csv('sample2.csv', names=['c1','c2','c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [125]:
pd.read_csv('sample1.csv', index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

- 확장자가 csv가 아닌 파일 즉, 데이터를 구분하는 구분자가 쉼표가 아니면 sep 인수를 써서 구분자를 사용자가 지정함
- 길이가 정해지지 않은 공백이 구분자인 경우에는 \s+ 정규식 문자열 사용

In [126]:
%%writefile sample3.txt

c1   c2    c3    c4
0.179181 -1.538472 1.347553 0.43381
1.024209 0.087307 -1.281997 0.49265
0.417899 -2.002308 0.255245 -1.10515

Writing sample3.txt

In [128]:
pd.read_table('sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

- 자료 파일 중에 건너 뛰어야 할 행이 있으면 skiprows 인수 사용

In [129]:
%%writefile sample4.txt
파일 제목 : sample4.txt
데이터 포맷의 설명 :
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [131]:
pd.read_csv('sample4.txt', skiprows=[0,1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [135]:
pd.read_table('sample4.txt')

  파일 제목 : sample4.txt
0        데이터 포맷의 설명 :
1          c1, c2, c3
2        1, 1.11, one
3        2, 2.22, two
4      3, 3.33, three

In [137]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Writing sample5.csv

In [139]:
df = pd.read_csv('sample5.csv', na_values=['누락'])
df

    c1     c2      c3
0  1.0   1.11     one
1  2.0            two
2  NaN   3.33   three

# CSV 파일 출력

In [140]:
df.to_csv('sample6.csv')

In [141]:
!cat sample6.csv

,c1, c2, c3
0,1.0, 1.11, one
1,2.0, , two
2,, 3.33, three

In [142]:
df.to_csv('sample7.txt', sep='|')

In [143]:
!cat sample7.txt

|c1| c2| c3
0|1.0| 1.11| one
1|2.0| | two
2|| 3.33| three

In [145]:
df.to_csv('sample8.csv', na_rep='누락')

In [146]:
!cat sample8.csv

,c1, c2, c3
0,1.0, 1.11, one
1,2.0, , two
2,누락, 3.33, three

- index, header 인수를 지정하여 인덱스 및 헤더 출력 여부 지정

In [147]:
df.index = ["a", "b", "c"]
df

    c1     c2      c3
a  1.0   1.11     one
b  2.0            two
c  NaN   3.33   three

In [148]:
df.to_csv('sample9.csv', index=False, header=False)

In [149]:
!cat sample9.csv

1.0, 1.11, one
2.0, , two
, 3.33, three

In [150]:
df.to_csv('sample10.csv', index=False, header=True)

In [151]:
!cat sample10.csv

c1, c2, c3
1.0, 1.11, one
2.0, , two
, 3.33, three

# 인터넷 상의 CSV 파일 입력

In [152]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [153]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [154]:
pd.set_option("display.max_rows", 20)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [155]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [157]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

# 인터넷 상의 데이터 베이스 자료 입력

- pandas_datareader 패키지의 DataReader를 사용하면 일부 인터넷 사이트 자료를 바로 pandas로 읽어들임
- pandas_datareader 패키지는 판다스와 별도로 설치해야 함

In [161]:
!pip install pandas_datareader

Collecting pandas_datareader
  Downloading pandas_datareader-0.9.0-py3-none-any.whl (107 kB)
     |████████████████████████████████| 107 kB 845 kB/s eta 0:00:01
Requirement already satisfied: pandas>=0.23 in /Users/Mac/opt/anaconda3/lib/python3.7/site-packages (from pandas_datareader) (1.0.1)
Requirement already satisfied: requests>=2.19.0 in /Users/Mac/opt/anaconda3/lib/python3.7/site-packages (from pandas_datareader) (2.22.0)
Requirement already satisfied: lxml in /Users/Mac/opt/anaconda3/lib/python3.7/site-packages (from pandas_datareader) (4.5.0)
Requirement already satisfied: python-dateutil>=2.6.1 in /Users/Mac/opt/anaconda3/lib/python3.7/site-packages (from pandas>=0.23->pandas_datareader) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /Users/Mac/opt/anaconda3/lib/python3.7/site-packages (from pandas>=0.23->pandas_datareader) (2019.3)
Requirement already satisfied: numpy>=1.13.3 in /Users/Mac/opt/anaconda3/lib/python3.7/site-packages (from pandas>=0.23->pandas_datareader) (1.18.1)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /Users/Mac/opt/anaconda3/lib/python3.7/site-packages (from requests>=2.19.0->pandas_datareader) (1.25.8)
Requirement already satisfied: idna<2.9,>=2.5 in /Users/Mac/opt/anaconda3/lib/python3.7/site-packages (from requests>=2.19.0->pandas_datareader) (2.8)
Requirement already satisfied: certifi>=2017.4.17 in /Users/Mac/opt/anaconda3/lib/python3.7/site-packages (from requests>=2.19.0->pandas_datareader) (2019.11.28)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /Users/Mac/opt/anaconda3/lib/python3.7/site-packages (from requests>=2.19.0->pandas_datareader) (3.0.4)
Requirement already satisfied: six>=1.5 in /Users/Mac/opt/anaconda3/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas>=0.23->pandas_datareader) (1.14.0)
Installing collected packages: pandas-datareader
Successfully installed pandas-datareader-0.9.0

In [162]:
import datetime
dt_start = datetime.datetime(2015,1,1)
dt_end = "2016, 6, 30"

In [163]:
import pandas_datareader as pdr
gdp = pdr.get_data_fred('GDP', dt_start, dt_end)
gdp.tail()

                  GDP
DATE
2015-04-01  18223.577
2015-07-01  18347.425
2015-10-01  18378.803
2016-01-01  18470.156
2016-04-01  18656.207

- 데이터 코드에 리스트를 넣으면 여러개의 데이터를 동시에 가져옴

In [165]:
inflation = pdr.get_data_fred(["CPIAUCSL","CPILFESL"], dt_start, dt_end)
inflation

            CPIAUCSL  CPILFESL
DATE
2015-01-01   234.747   239.811
2015-02-01   235.342   240.172
2015-03-01   235.976   240.755
2015-04-01   236.222   241.346
2015-05-01   237.001   241.688
2015-06-01   237.657   242.064
2015-07-01   238.034   242.565
2015-08-01   238.033   242.817
2015-09-01   237.498   243.316
2015-10-01   237.733   243.768
2015-11-01   238.017   244.241
2015-12-01   237.761   244.547
2016-01-01   237.827   245.075
2016-02-01   237.514   245.644
2016-03-01   237.990   245.964
2016-04-01   238.835   246.467
2016-05-01   239.440   247.036
2016-06-01   240.144   247.435

# 데이터프레임 고급 인덱싱

- pandas는 Numpy 행렬과 같이 쉼표를 사용한 (행 인덱스, 열 인덱스) 형식의 2차원 인덱싱 지원
- loc : 라벨값 기반의 2차원 인덱싱
- iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

# loc 인덱서
- df.loc[행 인덱싱 값]
- df.loc[행 인덱싱 값, 열 인덱싱 값]

In [168]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4),
                 index = ["a", "b", "c"],
                 columns = ["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

# 인덱싱값을 하나만 받는 경우

In [169]:
df.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [170]:
df.loc["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [171]:
df["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [173]:
df.loc[["b","c"]] #인덱스데이터의 리스트

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [174]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [175]:
df.loc[df.A>15]

    A   B   C   D
c  18  19  20  21

In [178]:
def select_rows(df):
    return df.A >15

In [179]:
select_rows(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [180]:
df.loc[select_rows(df)]

    A   B   C   D
c  18  19  20  21

In [181]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4,4),
                   columns=["A","B","C","D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [182]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [186]:
df2.loc[:,["A","C"]]

    A   C
0  10  12
1  14  16
2  18  20
3  22  24

# 인덱싱값을 행과 열 모두 받는 경우
- df.loc[행 인덱스, 열 인덱스]

In [187]:
df.loc["a","A"]

10

In [189]:
df.loc["b":,"A"]

b    14
c    18
Name: A, dtype: int64

In [190]:
df.loc["a", :]

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [191]:
df.loc[["a","b"],["B","D"]]

    B   D
a  11  13
b  15  17

In [192]:
df.loc[df.A>10, ["C","D"]]

    C   D
b  16  17
c  20  21

# iloc 인덱서
- iloc 인덱서는 loc 인덱서와 반대로 라벨이 아니라 순서를 나타내는 정수(integer) 인덱스만 받음

In [196]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [193]:
df.iloc[0,1]

11

In [194]:
df.iloc[:2,2]

a    12
b    16
Name: C, dtype: int64

In [195]:
df.iloc[0,-2:]

C    12
D    13
Name: a, dtype: int64

In [197]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [198]:
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int64

In [199]:
df.iloc[-1] = df.iloc[-1]*2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

- 연습문제 4.3.1 
 1. 모든 행에 열과 라벨을 가지는 5x5 이상의 크기를 가지는 데이터프레임 생성
 2. 10가지 이상의 방법으로 특정한 행과 열 선택

# 데이터프레임의 데이터 조작

### 데이터 갯수 세기 : count 메서드 사용 (NaN 값은 세지 않음)

In [201]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [203]:
s.count()

9

In [204]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
df.iloc[2,3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [205]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [207]:
import seaborn as sns
ti_df = sns.load_dataset("titanic")
ti_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

- 연습문제 4.4.1
 : 타이타닉호 승객 데이터의 데이터의 개수를 각 열마다 구하기

In [208]:
ti_df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

# 카테고리 값 세기

In [210]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int64

In [212]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

- 데이터프레임에는 value_counts 메서드가 없으므로 각 열마다 별도로 적용

In [213]:
df[0].value_counts()

3.0    2
4.0    1
0.0    1
Name: 0, dtype: int64

# 정렬
- 데이터를 정렬하려면 sort_index 메서드 sort_values 메서드 사용
- sort_index 메서드는 인덱스 값 기준, sort_values메서드는 데이터 값 기준 정렬

In [214]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [216]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [217]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [218]:
df.sort_values(by=1)

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [219]:
df.sort_values(by=[1,2])

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

- 연습 문제 4.4.2
 1. sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수,
선실별(class) 인원수, 사망/생존(alive) 인원수 구하기

In [225]:
ti_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [235]:
print(ti_df["sex"].sort_values())
print(ti_df["age"].sort_values().sort_index())
print(ti_df["class"].sort_values().sort_index())
print(ti_df["alive"].sort_values())

383    female
218    female
609    female
216    female
215    female
        ...
371      male
372      male
373      male
360      male
890      male
Name: sex, Length: 891, dtype: object
0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64
0       Third
1       First
2       Third
3       First
4       Third
        ...
886    Second
887     First
888     Third
889     First
890     Third
Name: class, Length: 891, dtype: category
Categories (3, object): [First, Second, Third]
0       no
519     no
521     no
522     no
524     no
      ...
546    yes
215    yes
216    yes
218    yes
445    yes
Name: alive, Length: 891, dtype: object

# 행/열 합계

In [237]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [238]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [239]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [240]:
df2.sum()

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64

In [241]:
df2.loc["ColTotal", :] = df2.sum()
df2

             0     1     2     3     4     5    6     7  RowSum
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0

- 연습 문제 4.4.3
 1. 타이타닉호 승객의 평균 나이
 2. 타이타닉호 승객 중 여성 승객의 평균 나이
 3. 타이타닉 승객 중 1등석 선실의 여성승객의 평균 나이

In [243]:
ti_df.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [245]:
# 타이타닉호 승객의 평균 나이
ti_df["age"].mean()

29.69911764705882

In [251]:
# 타이타닉호 승객 중 여성 승객의 평균 나이
ti_df["age"][ti_df["sex"]=="female"].mean()

27.915708812260537

In [283]:
ti_df[ti_df.sex == "female"]["age"].mean()

27.915708812260537

In [281]:
import time
a = time.time()
# 타이타닉 승객 중 1등석 선실의 여성 승객의 평균 나이
ti_df["age"][ti_df["class"] == "First"][ti_df["sex"] == "female"].mean()
print(time.time() - a)

0.005465984344482422

In [284]:
a = time.time()

ti_df[(ti_df["class"] == "First") & (ti_df["sex"] == "female")]["age"].mean()

print(time.time() - a)

0.002595186233520508

In [285]:
a = time.time()
ti_df["age"][(ti_df["class"]=="First") & (ti_df["sex"] == "female")].mean()

print(time.time() -a)

0.0033931732177734375

In [286]:
 # 타이타닉 호 승객 중 3등석 선실의 남성 승객의 평균 나이
ti_df[(ti_df["class"] == "Third") & (ti_df["sex"] == "male")]["age"].mean()

26.507588932806325

# apply 변환

In [287]:
df3 = pd.DataFrame({
    "A" : [1,3,4,3,4],
    "B" : [2,3,1,2,3],
    "C" : [1,5,2,4,4]
})

df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [288]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [289]:
df3.apply(lambda x : x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [290]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

- 타이타닉호 승객 중 나이 20살을 기준으로 성인과 미성년자를 구분하는 라벨 열

In [294]:
ti_df["adult/child"] = ti_df.apply(lambda r: "adult" if r.age>=20 else "child", axis=1)
ti_df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

- 연습문제 4.4.4
 : 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리열인 category1 열 생성
 1. 20살이 넘으면 성별을 그대로 사용
 2. 20살 미만이면 성별에 관계없이 'child'라고 함

In [303]:
ti_df["category1"] = ti_df.apply(lambda s: s["sex"] if s["age"]>=20 else "child", axis=1)
ti_df.tail(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

# fillna 메서드
-NaN 값은 fillna 메서드를 사용하여 원하는 값으로 바꿀 수 있음

In [304]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

- 연습문제 4.4.5
 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터 프레임 수정

In [306]:
ti_age = ti_df["age"].mean()
ti_age

29.69911764705882

In [322]:
ti_df["age"] = ti_df["age"].fillna(ti_age).round(2)

In [323]:
ti_df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

# astype 메서드
- 전체 데이터의 자료형 바꾸는 것 가능

In [324]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

- 연습 문제 4.4.6
: 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라.
 1. 성별을 나타내는 문자열 male, female로 시작
 2. 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 옴
 3. 예를 들어 27살 남성은 male27 값이 됨

In [330]:
ti_df["category2"] = ti_df["sex"]+ti_df["age"].astype(str)
ti_df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,male22.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,female38.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,female26.0

# 실수 값을 카테고리 값으로 변환
- 실수 값을 크기 기준으로 하여 카테고리 값으로 변환하고 싶을 때
- cut : 실수 값의 경계선을 지정하는 경우
- qcut : 갯수가 똑같은 구간으로 나누는 경우

In [331]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]
ages

[0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [333]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, 미성년자, 미성년자, 청년, 청년, ..., 장년, 미성년자, 중년, 중년, NaN]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [334]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [335]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [338]:
cats.codes # 속성을 정수로 인코딩한 카테고리 값

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [340]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4["ages"], bins, labels=labels)
df4

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11   101     NaN

In [342]:
# age_cat 열 값은 문자열이 아님. 이를 문자열로 바꾸기 위해 astype을 사용해야 함
df4["age_cat"].astype(str) + df4["ages"].astype(str)

0       nan0
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       중년37
6       중년31
7       장년61
8     미성년자20
9       중년41
10      중년32
11    nan101
dtype: object

- qcut : 구간 경계선 지정하지 않고 데이터 갯수가 같도록 지정한 수의 구간으로 나눔
- 아래의 예시 1000개의 데이터를 4개의 구간으로 나누는데 각 구간은 250 개씩의 데이터를 가짐

In [343]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

[Q2, Q1, Q2, Q3, Q1, ..., Q1, Q1, Q4, Q4, Q2]
Length: 1000
Categories (4, object): [Q1 < Q2 < Q3 < Q4]

In [344]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64

- 연습문제 4.4.7
 타이타닉호 승객을 '미성년자', '청년', '중년', '장년', '노년' 나이 그룹으로 나눔
 - bins = [1, 20, 30, 50, 70, 100]
 - labels = ["미성년자", "청년", "중년", "장년", "노년"]
 - 각 나이 그룹의 승객 비율을 구함. 비율 전체의 합은 1이 되어야 함

In [348]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

ti_df["age_category"] = pd.cut(ti_df["age"], bins, labels=labels)
ti_df["age_category"].astype(str)
ti_df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2,age_category
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,male22.0,청년
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,female38.0,중년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,female26.0,청년

- 연습 문제 4.4.8
- 타이타닉호의 승객에 대해 나이와 성별에 대한 카테고리 열인 category3 열 만들기
 1. 20살 미만이면 성별에 관계없이 "미성년자"
 2. 20살 이상이면 나이에 따라 "청년", "중년", "장년", "노년" 구분, 그 뒤에 성별을 나타내는 "남성", "여성 붙임

In [357]:
ti_df["sex_category"] = ti_df["sex"].map({"female" : "여성", "male" : "남성"})
ti_df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,...,deck,embark_town,alive,alone,adult/child,category1,category2,age_category,category3,sex_category
0,0,3,male,22.0,1,0,7.2500,S,Third,man,...,NaN,Southampton,no,False,adult,male,male22.0,청년,청년male,남성
1,1,1,female,38.0,1,0,71.2833,C,First,woman,...,C,Cherbourg,yes,False,adult,female,female38.0,중년,중년female,여성
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,...,NaN,Southampton,yes,True,adult,female,female26.0,청년,청년female,여성

In [358]:
ti_df["category3"] = ti_df.apply(lambda x: x["age_category"]+x["sex_category"] if x["age"] >=20 else "미성년자", axis=1)
ti_df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,...,deck,embark_town,alive,alone,adult/child,category1,category2,age_category,category3,sex_category
0,0,3,male,22.0,1,0,7.2500,S,Third,man,...,NaN,Southampton,no,False,adult,male,male22.0,청년,청년남성,남성
1,1,1,female,38.0,1,0,71.2833,C,First,woman,...,C,Cherbourg,yes,False,adult,female,female38.0,중년,중년여성,여성
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,...,NaN,Southampton,yes,True,adult,female,female26.0,청년,청년여성,여성